# =====================================================================================================
# 1. copy_t1 테이블의 모든 로우 삭제
# 2. commit 작업완료
# 3. t1 테이블의 모든 데이터를 copy_t1에 복사
# 4. copy_t1 테이블에서 co3 컬럼이 0.1인 로우 삭제
# 5. 작업 취소
# 6. 테이블 확인
# =====================================================================================================

# 1)
delete from copy_t1;

# 2)
commit;

# 3)
insert into copy_t1
select *
from t1;

# 4)
delete from copy_t1
where co3 like 0.1;

# 5)
rollback;				# 마지막 commit 상태로 rollback - 원자성

# 6)
select *
from copy_t1; 
